package org.example.lesson1;

/**
 * Удаление пробелов из строки.
 * Написать программу, которая удаляет все пробелы из заданной строки.
 */
public class Task8 {
    public static void main(String[] args) {
        String s = "bfks hsksld osd";
        System.out.println(s.replace(" ",""));
    }
}
